import Vue from 'vue'
import Router from 'vue-router'
import store from '@/store/index.js'
Vue.use(Router)
// 解决ele组件点击当前页路由时出错
const originalPush = Router.prototype.push
Router.prototype.push = function (location) {
  return originalPush.call(this, location).catch(err => err)
}

const routes = [
  {
    path: '/',
    redirect: '/login'
  }, {
    path: '/login',
    name: 'login',
    component: () => import('@/views/login.vue')
  }, {
    path: '/index',
    name: 'index',
    component: () => import('@/views/index.vue'),
    children: [
      {
        path: '/homePage/homePage',
        name: '首页',
        component: () => import('@/views/homePage/homePage.vue')
      }, {
        path: '/order/orderList/:params',
        name: '订单列表',
        component: () => import('@/views/order/orderList.vue')
      }, {
        path: '/order/orderCreate/:id',
        name: '添加订单信息',
        component: () => import('@/views/order/orderCreate.vue')
      }
    ]
  }
]
const router = new Router({
  mode: 'history',
  base: process.env.BASE_URL,
  routes
})

// 路由守卫结合vuex做面包屑用
router.beforeEach((to, from, next) => {
  // 获取标题
  store.commit('getTitle', to.name ? to.name : from.name)
  const routerTable = {
    '首页': ['织为云', '首页'],
    '编辑页': ['织为云', '编辑页'],
    '详情页': ['织为云', '详情页'],
    '列表页': ['织为云', '列表页'],
    '其它菜单': ['织为云', '其它菜单'],
    '样品添加': ['织为云', '样品添加'],
    '样品详情': ['织为云', '样品列表', '样品详情'],
    '样品修改': ['织为云', '样品列表', '样品修改'],
    '样品列表': ['织为云', '样品列表'],
    '样品订单添加': ['织为云', '样品订单添加'],
    '样品订单详情': ['织为云', '样品订单列表', '样品订单详情'],
    '样品订单修改': ['织为云', '样品订单列表', '样品订单修改'],
    '样品订单列表': ['织为云', '样品订单列表'],
    '产品添加': ['织为云', '产品添加'],
    '产品列表': ['织为云', '产品列表'],
    '产品详情': ['织为云', '产品列表', '产品详情'],
    '产品修改': ['织为云', '产品列表', '产品修改'],
    '报价单添加': ['织为云', '报价单添加'],
    '报价单修改': ['织为云', '报价单修改'],
    '报价单列表': ['织为云', '报价单列表'],
    '报价单详情': ['织为云', '报价单列表', '报价单详情'],
    '再次报价': ['织为云', '报价单列表', '报价单详情', '再次报价'],
    '工艺单列表': ['织为云', '工艺单列表'],
    '工艺单添加': ['织为云', '产品列表', '工艺单添加'],
    '工艺单修改': ['织为云', '产品列表', '工艺单修改'],
    '工艺单详情': ['织为云', '产品列表', '工艺单详情'],
    '添加订单信息': ['织为云', '添加订单信息'],
    '订单列表': ['织为云', '订单列表'],
    '订单发货列表': ['织为云', '订单发货列表'],
    '订单修改': ['织为云', '订单列表', '订单修改'],
    '订单详情': ['织为云', '订单列表', '订单详情'],
    '配料单列表': ['织为云', '配料单列表'],
    '配料单添加': ['织为云', '产品列表', '配料单添加'],
    '配料单修改': ['织为云', '产品列表', '配料单修改'],
    '配料单详情': ['织为云', '产品列表', '配料单详情'],
    '物料计划单添加': ['织为云', '物料计划单列表', '物料计划单添加'],
    '物料计划单列表': ['织为云', '物料计划单列表'],
    '物料计划单修改': ['织为云', '物料计划单列表', '物料计划单修改'],
    '物料计划单详情': ['织为云', '物料计划单列表', '物料计划单详情'],
    '物料预定购': ['织为云', '物料预定购'],
    '物料预定购列表': ['织为云', '物料预定购列表'],
    '物料预定购入库': ['织为云', '物料预定购列表', '物料预定购入库'],
    '物料预定购修改': ['织为云', '物料预定购列表', '物料预定购修改'],
    '仓库列表': ['织为云', '仓库列表'],
    '仓库详情': ['织为云', '仓库列表', '仓库详情'],
    '物料预订购': ['织为云', '物料预订购'],
    '物料预订购列表': ['织为云', '物料预订购列表'],
    '物料预订购入库': ['织为云', '物料预订购列表', '物料预订购入库'],
    '物料预订购修改': ['织为云', '物料预订购列表', '物料预订购修改'],
    '物料订购列表': ['织为云', '物料订购列表'],
    '物料订购': ['织为云', '物料订购列表', '物料订购'],
    // '物料批量订购列表': ['织为云', '物料批量订购列表'],
    '物料批量订购': ['织为云', '物料订购列表', '物料批量订购'],
    '系统设置': ['织为云', '系统设置'],
    '物料出入库列表': ['织为云', '物料出入库列表'],
    '物料出入库详情': ['织为云', '物料出入库列表', '物料出入库详情'],
    '物料出入库详情-客供版': ['织为云', '物料出入库列表', '物料出入库详情-客供版'],
    '物料批量出入库详情': ['织为云', '物料订购列表', '物料批量出入库详情'],
    '织造分配列表': ['织为云', '织造分配列表'],
    '工序分配详情': ['织为云', '工序分配列表', '工序分配详情'],
    '织造分配详情': ['织为云', '织造分配列表', '织造分配详情'],
    '织造分配': ['织为云', '织造分配列表', '织造分配详情'],
    '织造分配-客供纱': ['织为云', '织造分配列表', '织造分配-客供纱'],
    '半成品加工分配列表': ['织为云', '半成品加工分配列表'],
    '半成品加工分配详情': ['织为云', '半成品加工分配详情'],
    '装箱管理列表': ['织为云', '装箱管理列表'],
    '装箱计划单详情': ['织为云', '装箱管理列表', '装箱计划单详情'],
    '包装订购列表': ['织为云', '包装订购列表'],
    '包装订购详情': ['织为云', '装箱管理列表', '包装订购详情'],
    '产品收发列表': ['织为云', '产品收发列表'],
    '产品收发详情': ['织为云', '产品收发列表', '产品收发详情'],
    '产品检验列表': ['织为云', '产品检验列表'],
    '成品检验详情': ['织为云', '产品检验列表', '成品检验详情'],
    '半成品检验详情': ['织为云', '产品检验列表', '半成品检验详情'],
    '装箱出库列表': ['织为云', '装箱出库列表'],
    '装箱出库详情': ['织为云', '装箱管理列表', '装箱出库详情'],
    '设备管理': ['织为云', '设备管理'],
    '客户列表': ['织为云', '客户列表'],
    '客户添加': ['织为云', '客户列表', '客户添加'],
    '客户修改': ['织为云', '客户列表', '客户修改'],
    '客户详情': ['织为云', '客户列表', '客户详情'],
    '消息列表': ['织为云', '消息列表'],
    '发通知': ['织为云', '发通知'],
    '订单财务统计': ['织为云', '订单财务统计'],
    '样单财务统计': ['织为云', '样单财务统计'],
    '产品产量统计': ['织为云', '产品产量统计'],
    '物料使用统计': ['织为云', '物料使用统计'],
    '物料使用详情': ['织为云', '物料使用统计', '物料使用详情'],
    '合作公司财务统计': ['织为云', '合作公司财务统计'],
    '合作公司财务详情': ['织为云', '合作公司财务统计', '合作公司财务详情'],
    '合作公司财务操作记录': ['织为云', '合作公司财务统计', '合作公司财务详情', '合作公司财务操作记录'],
    '年度合计费用': ['织为云', '合作公司财务统计', '年度合计费用'],
    '添加员工': ['织为云', '添加员工'],
    '员工列表': ['织为云', '员工列表'],
    '员工详情': ['织为云', '员工列表', '员工详情'],
    '日常工资结算表': ['织为云', '员工列表', '日常工资结算表'],
    '修改员工': ['织为云', '员工列表', '修改员工'],
    '合计工资结算单': ['织为云', '合计工资结算单'],
    '操作记录统计': ['织为云', '操作记录统计'],
    '数据可视化': ['织为云', '数据可视化'],
    '添加报销单': ['织为云', '添加报销单'],
    '报销单详情': ['织为云', '报销单列表', '报销单详情'],
    '报销单修改': ['织为云', '报销单列表', '报销单修改'],
    '报销单列表': ['织为云', '报销单列表']
  }
  store.commit('getRoute', routerTable[to.name])
  next()
})
export default router
